#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

google_storage_bucket.default: Refreshing state... [id=davidbour-cloud-resume]
google_compute_managed_ssl_certificate.default: Refreshing state... [id=projects/cloudresume-380001/global/sslCertificates/cloud-resume-cert]
google_compute_global_address.default: Refreshing state... [id=projects/cloudresume-380001/global/addresses/resume]
google_storage_bucket_iam_member.default: Refreshing state... [id=b/davidbour-cloud-resume/roles/storage.objectViewer/allUsers]
google_compute_backend_bucket.default: Refreshing state... [id=projects/cloudresume-380001/global/backendBuckets/cloud-resume-backend-bucket]
google_project_service.firebase_database: Refreshing state... [id=cloudresume-380001/firebasedatabase.googleapis.com]
google_firebase_project.default: Refreshing state... [id=projects/cloudresume-380001]
google_api_gateway_api.api_cfg: Refreshing state... [id=projects/cloudresume-380001/locations/global/apis/visitor-api-gateway]
google_compute_url_map.default: Refreshing state... [id=projects/cloudresume-380001/global/urlMaps/http-lb]
google_compute_target_https_proxy.default: Refreshing state... [id=projects/cloudresume-380001/global/targetHttpsProxies/cloud-https-proxy]
google_api_gateway_api_config.api_cfg: Refreshing state... [id=projects/cloudresume-380001/locations/global/apis/visitor-api-gateway/configs/visitor-api-gateway-cfg-1]
google_compute_global_forwarding_rule.default: Refreshing state... [id=projects/cloudresume-380001/global/forwardingRules/https-lb-forwarding-rule]
google_api_gateway_gateway.api_gw: Refreshing state... [id=projects/cloudresume-380001/locations/us-central1/gateways/visitor-api-gateway]
google_firebase_database_instance.default: Refreshing state... [id=projects/cloudresume-380001/locations/us-central1/instances/cloudresume-380001-default-rtdb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_iam_policy.cloudrun-invoker will be read during apply
  # (config refers to values not yet known)
 <= data "google_iam_policy" "cloudrun-invoker" {
      + id          = (known after apply)
      + policy_data = (known after apply)

      + binding {
          + members = [
              + (known after apply),
            ]
          + role    = "roles/run.invoker"
        }
    }

  # google_api_gateway_api_config.api_cfg must be replaced
+/- resource "google_api_gateway_api_config" "api_cfg" {
      + api_config_id_prefix = (known after apply)
      ~ display_name         = "visitor-api-gateway-cfg-1" -> (known after apply)
      ~ id                   = "projects/cloudresume-380001/locations/global/apis/visitor-api-gateway/configs/visitor-api-gateway-cfg-1" -> (known after apply)
      - labels               = {} -> null
      ~ name                 = "projects/650273226296/locations/global/apis/visitor-api-gateway/configs/visitor-api-gateway-cfg-1" -> (known after apply)
      ~ project              = "cloudresume-380001" -> (known after apply)
      ~ service_config_id    = "visitor-api-gateway-cfg-1-2fxp180o0vqed" -> (known after apply)
        # (2 unchanged attributes hidden)

      + gateway_config { # forces replacement
          + backend_config {
              + google_service_account = (known after apply)
            }
        }

        # (1 unchanged block hidden)
    }

  # google_api_gateway_gateway.api_gw will be updated in-place
  ~ resource "google_api_gateway_gateway" "api_gw" {
      ~ api_config       = "projects/650273226296/locations/global/apis/visitor-api-gateway/configs/visitor-api-gateway-cfg-1" -> (known after apply)
        id               = "projects/cloudresume-380001/locations/us-central1/gateways/visitor-api-gateway"
        name             = "projects/cloudresume-380001/locations/us-central1/gateways/visitor-api-gateway"
        # (6 unchanged attributes hidden)
    }

  # google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "cloud-run-invoker"
      + description  = "Used to run Cloud Run"
      + disabled     = false
      + display_name = "Cloud Run Invoker"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_policy.default will be created
  + resource "google_service_account_iam_policy" "default" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + policy_data        = (known after apply)
      + service_account_id = (known after apply)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @david-bour, Action: `pull_request`*